{"containsTokens":false,"subtitles":[{"text":"Welcome to Practical Deep Learning for coders, lesson one.","startMs":1910,"durationMs":4340},{"text":"This is version five of this course, and it's the first new one we've done in two years.","startMs":6310,"durationMs":8050.000000000001},{"text":"So, we've got a lot of cool things to cover!","startMs":14360,"durationMs":1970},{"text":"It's amazing how much has changed.","startMs":17550,"durationMs":2260},{"text":"Here is an xkcd from the end of 2015. Who here has seen xkcd comics before?","startMs":21830,"durationMs":8980},{"text":"Pretty much everybody.","startMs":31270,"durationMs":1090},{"text":"Not surprising.","startMs":32360,"durationMs":970},{"text":"So the basic joke here is… I'll let you read it, and then I'll come back to it.","startMs":35350,"durationMs":6420},{"text":"So, it can be hard to tell what's easy and what's nearly impossible, and in 2015 or at the end of 2015 the idea of checking whether something is a photo of a bird was considered nearly impossible.","startMs":51790,"durationMs":10710},{"text":"So impossible, it was the basic idea of a joke.","startMs":62500,"durationMs":2920},{"text":"Because everybody knows that that's nearly impossible.","startMs":65420,"durationMs":2630},{"text":"We're now going to build exactly that system for free in about two minutes!","startMs":68390,"durationMs":4780},{"text":"So, let's build an “ is it a bird” system.","startMs":75230,"durationMs":1940},{"text":"So, we're going to use python, and I'm going to run through this really quickly.","startMs":79470,"durationMs":4550},{"text":"You're not expected to run through it with me because we're going to come back to it.","startMs":84020,"durationMs":3310},{"text":"But let's go ahead and run that cell.","startMs":87710,"durationMs":3780},{"text":"Okay, so what we're doing is we're searching DuckDuckgo for images of bird photos and we're just going to grab one and so here is the url of the bird that we grabbed.","startMs":94230,"durationMs":12540},{"text":"Okay, we'll download it.","startMs":109110,"durationMs":1300},{"text":"Okay, so there it is.","startMs":112750,"durationMs":1700},{"text":"So we've grabbed a bird and so okay we've now got something that can download pictures of birds.","startMs":114510,"durationMs":4900},{"text":"Now we're going to need to build a system that can recognize things that are birds versus things that aren't birds, from photos.","startMs":120790,"durationMs":7220},{"text":"Now of course computers need numbers to work with, but luckily images are made of numbers.","startMs":128110.00000000001,"durationMs":8700},{"text":"I actually found this really nice website called pixby where I can grab a bird, and if I wiggle over it","startMs":137150,"durationMs":12980},{"text":"you'll see here that that part of the beak was 251 brightness of red, 48 of green, and 21 of blue.","startMs":153110,"durationMs":9430},{"text":"So that's RGB.","startMs":162540,"durationMs":2110},{"text":"And so you can see as I wave around, those colors are changing .","startMs":164990,"durationMs":5540},{"text":"And so this picture, the thing that we recognize as a picture, is actually 256 x 171 x 3 numbers, between 0 and 255, representing","startMs":172030,"durationMs":15470},{"text":"the amount of red, green and blue on each pixel.","startMs":187500,"durationMs":2710},{"text":"So that's going to be an input to our program, that's going to try and figure out whether this is a picture of a bird or not.","startMs":190910,"durationMs":6940},{"text":"Okay, so let's go ahead and run this cell, which is going to go through… ( and I needed bird and non bird but you can't really search Google images or DuckDuckGo images for not a bird, it just doesn't work that way.","startMs":203870,"durationMs":14940},{"text":"So I just decided to use forest - I thought okay pictures of forest versus pictures of birds sounds like a good starting point.)","startMs":218990,"durationMs":6220},{"text":"So I go through each of: forest, and bird.","startMs":225710,"durationMs":2500},{"text":"And I search for forest photo and bird photo, download images, and then resize them to be no bigger than 400 pixels on a side - just because we don't need particularly big ones and it takes a surprisingly large amount of","startMs":229230,"durationMs":15070},{"text":"time just for a computer to open an image.","startMs":244300,"durationMs":2270},{"text":"Okay, so we've now got 200 of each.","startMs":246630,"durationMs":3580},{"text":"I find when I download images I often get a few broken ones and if you try and train a model with broken images it will not work.","startMs":250790,"durationMs":7450},{"text":"So here's something which just verifies each image and unlinks - so deletes the ones that don't work Okay, so now we can create what's called a data block.","startMs":258240,"durationMs":11530},{"text":"So after I run this cell you'll see that I've basically… I'll go through the details of this later, but… a data block gives fast.","startMs":270310,"durationMs":14910},{"text":"ai all the information it needs to create a computer vision model.","startMs":285220,"durationMs":3950},{"text":"And so in this case we're basically telling it… get all the image files that we just downloaded.","startMs":289230,"durationMs":3940},{"text":"And then we say show me a few up to six, and let's see… yeah, so we've got some birds, forest, bird, bird, forest.","startMs":294110,"durationMs":6070},{"text":"Okay, so one of the nice things about doing computer vision models is it's really easy to check your data because you can just look at it - which is not the case for a lot of kinds of models.","startMs":300180,"durationMs":8790},{"text":"Okay, so we've now downloaded 200 pictures of birds, 200 pictures of forests, so we'll now press run.","startMs":310150,"durationMs":9860},{"text":"And this model is actually running on my laptop, so this is not using a vast data center.","startMs":320670,"durationMs":6070},{"text":"It's running on my presentation laptop.","startMs":326740,"durationMs":2760},{"text":"And it's doing it at the same time as my laptop is streaming video, which is possibly a bad idea.","startMs":329500,"durationMs":5630},{"text":"And so what it's going to do is it's going to run through every photo out of those 400, and for the ones that are forest it's going to learn a bit more about what forest looks like","startMs":337390,"durationMs":12250},{"text":"and for the ones that are bird it'll learn a bit more about what bird looks like.","startMs":349640,"durationMs":2970},{"text":"So overall it took under 30 seconds, and believe it or not, that's enough to finish doing the thing which was in that xkcd comic.","startMs":353310,"durationMs":13410},{"text":"Let's check by passing in that bird that we downloaded at the start.","startMs":366720,"durationMs":5090},{"text":"This is a bird.","startMs":372150,"durationMs":1580},{"text":"Probability it's a bird: 1.0000 ( rounded to the nearest four decimal places).","startMs":374150,"durationMs":6300},{"text":"So something pretty extraordinary has happened since late 2015, which is literally something that has gone from so impossible it's a joke to so easy that I can run it on my laptop computer","startMs":380990,"durationMs":15620},{"text":"in about two minutes.","startMs":396750,"durationMs":3220},{"text":"And so hopefully that gives you a sense that creating really interesting, you know real working programs with deep learning is something that… doesn't take a lot of code, didn't take any math,","startMs":401390,"durationMs":15340},{"text":"didn't take more than my laptop computer.","startMs":417470,"durationMs":2100},{"text":"It's pretty accessible in fact.","startMs":420990,"durationMs":2380},{"text":"So that's really what we're going to be learning about over the next seven weeks.","startMs":423510,"durationMs":4780},{"text":"So where have we got to now with deep learning?","startMs":429070,"durationMs":2970},{"text":"Well it moves so fast, but even in the last few weeks we've taken it up another notch as a community.","startMs":432040,"durationMs":10080},{"text":"You might have seen that something called DALLꞏ Eꞏ 2 has been released which uses deep learning to generate new pictures.","startMs":442120,"durationMs":7560},{"text":"And I thought this was an amazing thing that this guy nick did where he took his friends twitter bios and typed them into the DALLꞏ Eꞏ 2 input and it generated these pictures.","startMs":449680,"durationMs":12250},{"text":"So this guy's… he typed in commitment, sympathetic, psychedelic, philosophical, and it generated these pictures.","startMs":462190,"durationMs":6570},{"text":"So I'll just show you a few of these.","startMs":468760,"durationMs":1220},{"text":"I'll let you read them… I love that.","startMs":469980,"durationMs":5270},{"text":"That one's pretty amazing I reckon!","startMs":484950,"durationMs":1860},{"text":"actually.","startMs":488150,"durationMs":620},{"text":"I love this.","startMs":495870,"durationMs":730},{"text":"Happy Sisyphus has actually got a happy rock to move around.","startMs":496600,"durationMs":4210},{"text":"So this is like, um, yeah, I don't know.","startMs":502590,"durationMs":3930},{"text":"When I look at these I still get pretty blown away that this is a computer algorithm using nothing but this text input to generate these arbitrary pictures.","startMs":506520,"durationMs":10740},{"text":"In this case of fairly, you know, complex and creative things.","startMs":517260,"durationMs":3430},{"text":"So the guy who made those points out, this is like… he spends about two minutes or so, you know, creating each of these.","startMs":522070.00000000006,"durationMs":6990},{"text":"Like he tries a few different prompts and he tries a few different pictures, you know, and so he's given an example here of…","startMs":529060,"durationMs":5040},{"text":"like when he types something into the system…","startMs":534100,"durationMs":1420},{"text":"like, here's an example of like 10 different things he gets back when he puts in “","startMs":535520,"durationMs":5520},{"text":"expressive painting of a man shining rays of justice and transparency, on a blue bird twitter logo.” So it's not just, you know, DALLꞏ Eꞏ 2, to be clear.","startMs":541040,"durationMs":11020},{"text":"There's, you know, a lot of different systems doing something like this now.","startMs":552060,"durationMs":3320},{"text":"There's something called MidJourney, which this twitter account posted: a “ female scientist with a laptop writing code, in a symbolic, meaningful, and vibrant style.” This one here is “ an HD photo of a rare psychedelic pink elephant.”","startMs":555380,"durationMs":14510},{"text":"And this one I think is the second one here","startMs":571230,"durationMs":2180},{"text":"This one's pretty cool “ a blind bat with big sunglasses holding a walking stick in his hand.” And so when actual artists, you know, this for example,","startMs":575910,"durationMs":15110},{"text":"this guy said he knows nothing about art, you know he's got no artistic talent, it's just something you know, he threw together.","startMs":591020,"durationMs":6270},{"text":"This guy is an artist who actually writes his own software based on deep learning and spends, you know, months on building stuff, and as you can see, you can really take it to the next level.","startMs":597430,"durationMs":10580},{"text":"It's been really great actually to see how a lot of fast.","startMs":608830,"durationMs":3990},{"text":"ai alumni with backgrounds as artists have gone on to bring deep learning and art together, and it's a very exciting direction.","startMs":612820,"durationMs":7350},{"text":"And it's not just images to be clear, you know one of another interesting thing that's popped up in the last couple of weeks is google's pathways language model which can take any arbitrary english as text, a question, and can create","startMs":620990,"durationMs":15310},{"text":"an answer which not only answers the question but also explains its thinking ( whatever it means for a language model to be thinking.)","startMs":636300,"durationMs":9670},{"text":"One of the ones I found pretty amazing was that it can explain a joke.","startMs":647510,"durationMs":3220},{"text":"I'll let you read this…","startMs":651310,"durationMs":1260},{"text":"So, this is actually a joke that probably needs explanations for anybody who's not familiar with TPUs.","startMs":667350,"durationMs":7030},{"text":"So it, this model, just took the text as input and created this text as output.","startMs":674380,"durationMs":5390},{"text":"And so you can see, you know, again, deep learning models are doing things which I think very few, if any of us, would have believed would be maybe possible to do by computers even in our lifetime","startMs":681310,"durationMs":12580},{"text":"This means that there is a lot of practical and ethical considerations.","startMs":697510,"durationMs":5620},{"text":"We will touch on them during this course but can't possibly hope to do them justice.","startMs":704710,"durationMs":4820},{"text":"So I would certainly encourage you to check out ethics.","startMs":709990,"durationMs":3170},{"text":"fast.","startMs":713160,"durationMs":440},{"text":"ai to see our whole data ethics course, taught by my co founder Dr Rachel Thomas, which goes into these issues in a lot more detail.","startMs":713600,"durationMs":12170},{"text":"All right, so as well as being an AI researcher at the University of Queensland and fast.","startMs":728230,"durationMs":6510},{"text":"ai, I am also a homeschooling primary school teacher and for that reason I study education a lot.","startMs":734740,"durationMs":7950},{"text":"One of the people who I love in education is a guy named Dylan Williams and he has this great approach in his classrooms of figuring out how his students are getting along, which is to put a coloured cup on their desk","startMs":743950,"durationMs":13210},{"text":"green to mean that they're doing fine, yellow cup to mean I'm not quite sure, and a red cup to mean I have no idea what's going on.","startMs":757160,"durationMs":9650},{"text":"Now since most of you are watching this remotely I can't look at your cups and I don't think anybody bought coloured cups with them today, so instead we have an online version of this.","startMs":766830,"durationMs":10780},{"text":"So what I want you to do is go to cups.","startMs":779110,"durationMs":5550},{"text":"fast.","startMs":784660,"durationMs":480},{"text":"ai/ fast - that's cups.","startMs":785140,"durationMs":4190},{"text":"fast.","startMs":789710,"durationMs":750},{"text":"ai/ fast - and don't do this if you're, like, a fast.","startMs":790460,"durationMs":5720},{"text":"ai expert who's done the course five times - because if you're following along that doesn't really mean much obviously.","startMs":796180,"durationMs":4880},{"text":"This is really for people who are, you know, not already fast.","startMs":801060,"durationMs":3720},{"text":"ai experts.","startMs":804780,"durationMs":700},{"text":"And so click one of these colored buttons.","startMs":805480,"durationMs":2570},{"text":"And what I will do, is I will go to the teacher version and see what buttons you're pressing.","startMs":810390,"durationMs":7460},{"text":"All right!","startMs":818630,"durationMs":770},{"text":"So, so far people are feeling we're not going too fast on the whole.","startMs":819400,"durationMs":3080},{"text":"We've got one, nope not one, brief red.","startMs":822480,"durationMs":2290},{"text":"Okay!","startMs":825190,"durationMs":620},{"text":"So, hey Nick, this url, the same thing with teacher on the end, if you can you keep that open as well and let me know if it suddenly gets covered in red.","startMs":826630,"durationMs":11420},{"text":"If you are somebody who's red, I'm not going to come to you now because there's not enough of you to stop the class.","startMs":839870,"durationMs":8890},{"text":"So it's up to you to ask on the forum or on the youtube live chat, and there's a lot of folks luckily who will be able to help you, I hope.","startMs":848760,"durationMs":8890},{"text":"All right!","startMs":858990,"durationMs":780},{"text":"I wanted to do a big shout out to Radek.","startMs":863350,"durationMs":2770},{"text":"Radeck created cups.","startMs":866120,"durationMs":2080},{"text":"fast.","startMs":868200,"durationMs":420},{"text":"ai for me.","startMs":868620,"durationMs":900},{"text":"I said to him last week I need a way of seeing coloured cups on the internet and he wrote it in one evening.","startMs":869520,"durationMs":7450},{"text":"And I also wanted to shout out that Radek just announced today that he got a job at Nvidia AI and I wanted to say, you know, that fast.","startMs":878870,"durationMs":8570},{"text":"ai alumni around the world very very frequently, like every day or two, email me to say that they've got their dream job.","startMs":887440,"durationMs":8130.000000000001},{"text":"Yeah… If you're looking for inspiration on how to get into the field I couldn't recommend nothing… nothing would be better than checking out Radek's work.","startMs":898270,"durationMs":9390},{"text":"And he's actually written a book about his journey.","startMs":907660,"durationMs":2700},{"text":"It's got a lot of tips in particular about how to take advantage of fast.","startMs":910360,"durationMs":2860},{"text":"ai - make the most of these lessons.","startMs":913220,"durationMs":2640},{"text":"And so I would certainly… so check that out as well.","startMs":915860,"durationMs":2710},{"text":"And if you're here live he's one of our TAs as well so you can say hello to him afterwards.","startMs":918670,"durationMs":3770},{"text":"He looks exactly like this picture here.","startMs":922440,"durationMs":2450},{"text":"So I mentioned I spent a lot of time studying education both for my home schooling duties and also for my courses, and you'll see that there's something a bit different, very different, about this course… which is that we started","startMs":928070,"durationMs":15110},{"text":"by training a model.","startMs":943180,"durationMs":1120},{"text":"We didn't start by doing an in depth review of linear algebra and calculus.","startMs":944300,"durationMs":4790},{"text":"That's because two of my favorite writers and researchers on education Paul Lockhart and David Perkins, and many others talk about how much better people learn when they learn with a context in place.","startMs":949950,"durationMs":15180},{"text":"So the way we learn math at school where we do counting and then adding and then fractions and then decimals and then blah blah blah and you know, 15 years later we start doing the really interesting stuff at grad school.","startMs":965270,"durationMs":14020},{"text":"That is not the way most people learn effectively.","startMs":979950,"durationMs":3950},{"text":"The way most people learn effectively is from the way we teach sports, for example, where we show you a whole game of sports.","startMs":983900,"durationMs":8430},{"text":"We show you how much fun it is.","startMs":992550,"durationMs":1830},{"text":"You go and start playing sports, simple versions of them, you're not very good right and then you gradually put more and more pieces together.","startMs":994380,"durationMs":7220},{"text":"So that's how we do deep learning.","startMs":1001600,"durationMs":1850},{"text":"You will go into as much depth as the most sophisticated, technically detailed classes you'll find - later, right!","startMs":1004190,"durationMs":13300},{"text":"But first you'll learn to be very very good at actually building and deploying models.","startMs":1017510,"durationMs":6260},{"text":"And you will learn why and how things work as you need, to get to the next level.","startMs":1024310,"durationMs":7820},{"text":"For those of you that have spent a lot of time in technical education ( like if you've done a phd or something) will find this deeply uncomfortable because you'll be wanting to understand why everything works from the start.","startMs":1032430.0000000001,"durationMs":9980},{"text":"Just do your best to go along with it.","startMs":1043109.9999999999,"durationMs":1690},{"text":"Those of you who haven't will find this very natural.","startMs":1044800,"durationMs":2890},{"text":"Oh!","startMs":1048069.9999999999,"durationMs":410},{"text":"And this is Dylan Wiliam, who I mentioned before - the guy who came up with the really cool cups things.","startMs":1048480,"durationMs":4810},{"text":"There'll be a lot of tricks that have come out of the educational research literature scattered through this course.","startMs":1054390,"durationMs":8109.999999999999},{"text":"On the whole I won't call them out, they'll just be there, but maybe from time to time we'll talk about them.","startMs":1062500,"durationMs":4230},{"text":"All right!","startMs":1067630,"durationMs":670},{"text":"So before we start talking about how we actually built that model and how it works, I guess I should convince you that I'm worth listening to.","startMs":1068300,"durationMs":7540},{"text":"I'll try to do that reasonably quickly, because I don't like tooting my own horn, but I know it's important.","startMs":1075840,"durationMs":6130},{"text":"So the first thing I mentioned about me, is that me and my friend Silvain wrote this extremely popular book “ Deep Learning for Coders” and that book is what this course is quite heavily based on.","startMs":1083030,"durationMs":10460},{"text":"We're not going to be using any material from the book directly, and you might be surprised by that, but the reason actually is that the educational research literature shows that people learn things best when they hear the same thing in","startMs":1094150,"durationMs":12770},{"text":"multiple different ways.","startMs":1106920,"durationMs":1130},{"text":"So I want you to read the book and you'll also see the same information presented in a different way, in these videos.","startMs":1108230,"durationMs":7620},{"text":"So on, e of the bits of homework after each lesson will be to read a chapter of the book.","startMs":1116710,"durationMs":5260},{"text":"A lot of people like the book.","startMs":1123030,"durationMs":1620},{"text":"Peter Norvig, Director of Research, loves the book.","startMs":1125710,"durationMs":2190},{"text":"In fact his ones here “ one of the best sources for a programmer to become proficient in deep learning.” Eric Topple loves the book.","startMs":1127900,"durationMs":8700},{"text":"Hal Varian Emeritus Professor at Berkeley, Chief Economist, Google, likes the book.","startMs":1136600,"durationMs":3810},{"text":"Jerome Pecente who is the head of AI at Facebook likes the book.","startMs":1141230,"durationMs":4370},{"text":"A lot of people like the book, so hopefully you'll find that you like this material as well.","startMs":1145600,"durationMs":6610},{"text":"I've spent about 30 years of my life working in and around machine learning including building a number of companies that relied on it.","startMs":1153070,"durationMs":7940},{"text":"And became the highest ranked competitor in the world on Kaggle in machine learning competitions.","startMs":1162430,"durationMs":5700},{"text":"My company Enlitic, which I founded, was the first company to specialize in deep learning for medicine, and MIT voted it one of the 50 smartest companies in 2016, just above Facebook and Spacex.","startMs":1169390,"durationMs":11460},{"text":"I started fast.","startMs":1184110,"durationMs":1270},{"text":"ai with Rachel Thomas and that was quite a few years ago now, but it's had a big impact on the world already, including work we've done with our students, has been globally recognized,","startMs":1185380,"durationMs":15440},{"text":"such as our win in the DAWNBench competition which showed how we could train big neural networks faster than anybody in the world, and cheaper than anybody in the world.","startMs":1200820,"durationMs":10790},{"text":"And so that was a really big step in 2018, which actually made a big difference.","startMs":1213550,"durationMs":6740},{"text":"Google started using our special approaches in their models.","startMs":1220430,"durationMs":5220},{"text":"Nvidia started optimizing their stuff using our approaches.","startMs":1225670,"durationMs":4460},{"text":"So it made quite a big difference there.","startMs":1230950,"durationMs":1780},{"text":"I'm the inventor of the ULMFiT algorithm which according to the Transformers book was one of the two key foundations behind the modern NLP revolution.","startMs":1234190,"durationMs":11460},{"text":"This is the paper here.","startMs":1246550,"durationMs":3900},{"text":"And actually, you know, interesting point about that, it was actually invented for a fast.","startMs":1250630,"durationMs":7030},{"text":"ai course.","startMs":1257660,"durationMs":600},{"text":"So the first time it appeared was not actually in the journal.","startMs":1258260,"durationMs":7380},{"text":"It was actually in lesson four of the course, I think, the 2016 course, if I remember correctly.","startMs":1265640,"durationMs":7570},{"text":"And, you know, most importantly of course, I've been teaching this course since Version One.","startMs":1275270,"durationMs":5660},{"text":"And this is actually, I think, this is the very first version of it ( which even back then was getting hbr's attention) a lot of people have been watching the course, and it's been, you know, really widely used.","startMs":1281270,"durationMs":14500},{"text":"Youtube doesn't show likes anymore, so I have to show you our likes for you.","startMs":1296830,"durationMs":3420},{"text":"You know it's been amazing to see how many alumni have gone from this to, you know, to really doing amazing things, you know.","startMs":1301870,"durationMs":14330},{"text":"And so for example Andrej Karpathy told me that at Tesla, I think he said, pretty much everybody who joins Tesla in AI is meant to do this course.","startMs":1316200,"durationMs":8850},{"text":"I believe at OpenAI, they told me that all the residents joining there first do this course.","startMs":1325270,"durationMs":5140},{"text":"So this, you know this course, is really widely used in industry and research for people, and they have a lot of success.","startMs":1330950,"durationMs":7100},{"text":"Okay, so there's a bit of brief information about why you should hopefully keep going with this.","startMs":1338830,"durationMs":6060},{"text":"All right so let's get back to what's happened here.","startMs":1346030,"durationMs":2810},{"text":"Why are we able to create a bird recognizer in a minute or two?","startMs":1348840,"durationMs":6650},{"text":"And why couldn't we do it before?","startMs":1356150,"durationMs":1740},{"text":"So I'm going to go back to 2012 and in 2012 this was how image recognition was done.","startMs":1358790,"durationMs":6780},{"text":"This is the computational pathologist - it was a project done at Stanford.","startMs":1366070,"durationMs":6460},{"text":"A very successful, very famous project that was looking at the five year survival of breast cancer patients by looking at their histopathology image slides.","startMs":1372750,"durationMs":11140},{"text":"Now, so this is, like, what I would call a classic machine learning approach.","startMs":1384710,"durationMs":4300},{"text":"And I spoke to the senior author of this, Daphne Koller, and I asked her why they didn't use deep learning and she said “ well it just, you know, it wasn't really on the radar at that point.” So this is like a pre deep learning approach.","startMs":1389390,"durationMs":12820},{"text":"And so the way they did this was they got a big team of mathematicians and computer scientists and pathologists and so forth to get together and build these ideas for features, like relationships between epithelial nuclear neighbors.","startMs":1402710,"durationMs":12460},{"text":"Thousands and thousands actually they created of features, and each one required a lot of expertise from a cross disciplinary group of experts at Stanford.","startMs":1416110,"durationMs":8100},{"text":"So this project took years, and a lot of people, and a lot of code, and a lot of math.","startMs":1424230,"durationMs":5140},{"text":"And then once they had all these features they then fed them into a machine learning model - in this case, logistic regression, to predict survival.","startMs":1429550,"durationMs":7930},{"text":"As I say it's very successful, right, but it's not something that I could create for you in a minute at the start of a course.","startMs":1437480,"durationMs":7690},{"text":"The difference with neural networks is neural networks don't require us to build these features.","startMs":1446950,"durationMs":4460},{"text":"They build them for us!","startMs":1451510,"durationMs":1940},{"text":"And so what actually happened was, in I think it was 2015, Matt Zeiler and Rob Fergus took a trained neural network and they looked inside it to see what it had learned.","startMs":1454070,"durationMs":13750},{"text":"So we don't give it features, we ask it to learn features.","startMs":1467820,"durationMs":5190},{"text":"So when Zeiler and Zeiler looked inside a neural network, they looked at the actual weights in the model and they drew a picture of them.","startMs":1473270,"durationMs":10390},{"text":"And this was nine of the sets of weights they found.","startMs":1483660,"durationMs":2710},{"text":"And this set of weights, for example, finds diagonal edges.","startMs":1486990,"durationMs":3340},{"text":"This set of weights finds yellow to blue gradients.","startMs":1490510,"durationMs":2970},{"text":"And this set of weights finds red to green gradients, and so forth, right.","startMs":1493480,"durationMs":5300},{"text":"And then down here are examples of some bits of photos which closely matched, for example, this feature detector.","startMs":1498780,"durationMs":8630},{"text":"And deep learning, I mean, is deep because we can then take these features and combine them to create more advanced features.","startMs":1507670,"durationMs":10140},{"text":"So these are some layer two features.","startMs":1518630,"durationMs":2020},{"text":"So there's a feature, for example, that finds corners.","startMs":1520670,"durationMs":2860},{"text":"And a feature that finds curves.","startMs":1523830,"durationMs":1730},{"text":"And a feature that finds circles.","startMs":1525560,"durationMs":1610},{"text":"And here are some examples of bits of pictures that the circle finder found.","startMs":1527350,"durationMs":5090},{"text":"And so remember with a neural net which is the basic function used in deep learning, we don't have to hand code any of these or come up with any of these ideas.","startMs":1532440,"durationMs":10290},{"text":"You just start with actually a random neural network and your feed it examples and you have it learn to recognize things, and it turns out that these are the things that it creates for itself.","startMs":1543430,"durationMs":13740},{"text":"So you can then combine these features.","startMs":1558390,"durationMs":4500},{"text":"And when you combine these features it creates a feature detector, for example, that finds kind of repeating geometric shapes.","startMs":1563190,"durationMs":7420},{"text":"And it creates a feature detector, for example, that finds kind of frilly little things, which it looks like is finding the edges of flowers.","startMs":1571350,"durationMs":7940},{"text":"And this feature detector here seems to be finding words.","startMs":1580310,"durationMs":4260},{"text":"And so the deeper you get the more sophisticated the features it can find are.","startMs":1585870,"durationMs":4950},{"text":"And so you can imagine that trying to code these things by hand would be, you know, insanely difficult, and you wouldn't know even what to encode by hand, right!","startMs":1590820,"durationMs":9440},{"text":"So what we're going to learn is how neural networks do this automatically, right, but this is the key difference of why we can now do things that previously we just didn't even conceive of as possible, because now we don't have to hand code","startMs":1600260,"durationMs":15790},{"text":"the features we look for.","startMs":1616150,"durationMs":1340},{"text":"They can all be learned.","startMs":1617510,"durationMs":1940},{"text":"it's important to recognize we're going to be spending some time learning about building image based algorithms and image based algorithms are not just for images and in fact this is going to be a general theme.","startMs":1624270,"durationMs":13170},{"text":"We're going to show you some foundational techniques but with creativity these foundational techniques can be used very widely.","startMs":1637440,"durationMs":7800},{"text":"So for example, an image recognizer can also be used to classify sounds.","startMs":1645240,"durationMs":10650},{"text":"So this was an example from one of our students who posted on the forum and said for their project they would try classifying sounds and so they basically took sounds and created pictures from their waveforms and then they","startMs":1655910,"durationMs":15150},{"text":"used an image recognizer on that and they got a state of the art result by the way.","startMs":1671060,"durationMs":3910},{"text":"Another of our students on the forum said that they did something very similar to take time series and turn them into pictures and then use image classifiers.","startMs":1676030,"durationMs":9340},{"text":"Another of our students created pictures from mouse movements from... from users of a computer system.","startMs":1686230,"durationMs":7780},{"text":"So the clicks became dots and the movements became lines and the speed of the movement became colors and then used that to create an image classifier.","startMs":1694070,"durationMs":9470},{"text":"So you can see with... with some creativity there's a lot of things you can do with images.","startMs":1703540,"durationMs":8470},{"text":"There's something else I wanted to point out which is that as you saw when we trained a real working bird recognizer image model we didn't need lots of math; there wasn't any.","startMs":1713470,"durationMs":13540},{"text":"We didn't need lots of data.","startMs":1727710,"durationMs":1350},{"text":"We had 200 pictures.","startMs":1729060,"durationMs":1390},{"text":"We didn't need lots of expensive computers; we just used my laptop.","startMs":1730510,"durationMs":3620},{"text":"This is generally the case for the vast majority of deep learning that you'll need in... in real life.","startMs":1734950,"durationMs":8220},{"text":"There will be some math that pops up during this course but we will teach it to you as needed or we'll refer you to external resources as... as needed but it'll just be the little bits that you actually need.","startMs":1745710,"durationMs":11260},{"text":"You know the myth that deep learning needs lots of data, I think, is mainly passed along by big companies that want to sell you computers to store lots of data and to process it.","startMs":1759150,"durationMs":11020},{"text":"We find that most real world projects don't need extraordinary amounts of data at all and as you'll see there's actually a lot of fantastic places you can do state of the art work for free nowadays which","startMs":1770550,"durationMs":15150},{"text":"is... which is great news.","startMs":1785700,"durationMs":1350},{"text":"One of the key reasons for this is because of something called transfer learning which we'll be learning about a lot during this course and it's something which very few people are aware of the pay off.","startMs":1790750,"durationMs":10940},{"text":"In this course we'll be using Pytorch.","startMs":1803870,"durationMs":4019.9999999999995},{"text":"For those of you who are not particularly close to the deep learning world, you might have heard of Tensorflow and not of Pytorch.","startMs":1808270,"durationMs":9140},{"text":"You might be surprised to hear that Tensorflow has been dying in popularity in recent years and Pytorch is actually growing rapidly and in… in","startMs":1817670,"durationMs":15100},{"text":"research repositories amongst the top papers, Tensorflow is a tiny minority now compared to Pytorch.","startMs":1834030,"durationMs":9940},{"text":"This is also great research that's come out from Ryan O'Connor.","startMs":1844470,"durationMs":3730},{"text":"He also discovered that... the majority of people that were doing Tensorflow in 2018 researchers, the majority have now shifted to Pytorch and I mention this because what","startMs":1848200,"durationMs":15100},{"text":"people use in research is a very strong leading indicator of what's going to happen in industry because this is where you know all the new algorithms are going to come out.","startMs":1863300,"durationMs":7940},{"text":"this is where all the papers are going to be written about.","startMs":1871240,"durationMs":2009.9999999999998},{"text":"it's going to be increasingly difficult to use Tensorflow.","startMs":1873990,"durationMs":3620},{"text":"We've been using Pytorch since before it came out, before the initial release because we knew just from technical fundamentals, it was far better.","startMs":1878470,"durationMs":8180},{"text":"So this course has been using Pytorch for a long time.","startMs":1887190,"durationMs":2500},{"text":"I will say however that Pytorch requires a lot of hairy code for relatively simple things.","startMs":1890430,"durationMs":5780},{"text":"This is the code required to implement a particular optimizer called AdamW in plain Pytorch.","startMs":1896710,"durationMs":6500},{"text":"I actually copied this code from the Pytorch repository so as you can see there's a lot of it.","startMs":1903230,"durationMs":6380},{"text":"This gray bit here is the code required to do the same thing with fast.","startMs":1911070,"durationMs":6050},{"text":"ai.","startMs":1917120,"durationMs":370},{"text":"fast.","startMs":1917750,"durationMs":490},{"text":"ai is a library we built on top of Pytorch.","startMs":1918240,"durationMs":3050},{"text":"This huge difference is not because Pytorch is bad.","startMs":1922150,"durationMs":3790},{"text":"It's because Pytorch is designed to be a strong foundation to build things on top of, like fast.","startMs":1925940,"durationMs":6620},{"text":"ai.","startMs":1932560,"durationMs":370},{"text":"So...","startMs":1933350,"durationMs":620},{"text":"When you use fast.","startMs":1935870,"durationMs":1030},{"text":"ai - the library, you get access to all the power of Pytorch as well but you shouldn't be writing all this code if you only need to write this much code, right?","startMs":1936900,"durationMs":11520},{"text":"The problem of writing lots of code is that that's lots of things to make mistakes with, lots of things to, you know, not have best practices in, lots of things to maintain.","startMs":1948420,"durationMs":9350},{"text":"In general we've found, particularly with deep learning: less code is better.","startMs":1957830,"durationMs":4780},{"text":"Particularly with fastai, the code you don't write is code that we've basically found kind of best practices for you.","startMs":1962630,"durationMs":9620},{"text":"So when you use the code that we've provided for you, you know you'll generally find you get better results.","startMs":1972270,"durationMs":6420},{"text":"So... so fast.","startMs":1979150,"durationMs":2150},{"text":"ai has been a really popular library and it's very widely used in industry, in academia, and in teaching","startMs":1981300,"durationMs":7990},{"text":"and as we go through this course we'll be seeing more and more pure Pytorch as we get deeper and deeper underneath to see exactly how things work.","startMs":1990230,"durationMs":9860},{"text":"The fast.","startMs":2002110,"durationMs":630},{"text":"ai library just won the 2020 best paper award for the paper about it in Information so again you can see it's a very well regarded library.","startMs":2002740,"durationMs":10470},{"text":"Okay so… Okay we're still green, that's good.","startMs":2014310,"durationMs":5740},{"text":"So you may have noticed something interesting, which is that I'm actually running code in these slides.","startMs":2021350,"durationMs":8220},{"text":"That's because these slides are not in PowerPoint.","startMs":2030110,"durationMs":2620},{"text":"These slides are in a Jupyter notebook.","startMs":2032790,"durationMs":5980},{"text":"Jupyter notebook is the environment in which you will be doing most of your computing.","startMs":2039310,"durationMs":8540},{"text":"It's a web based application which is extremely popular and widely used in industry and in academia and in teaching and it is a very very very powerful way to","startMs":2048710,"durationMs":15420},{"text":"to experiment and explore and to build.","startMs":2064270,"durationMs":2900},{"text":"Nowadays I would say most people at least most students run jupyter notebooks not on their own computers particularly for data science but on a cloud server of which there's quite a few","startMs":2070670,"durationMs":15260},{"text":"and as I mentioned earlier if you go to course.","startMs":2086070.0000000002,"durationMs":3150},{"text":"fast.","startMs":2089219.9999999998,"durationMs":460},{"text":"ai you can see how to use various different cloud servers.","startMs":2089679.9999999998,"durationMs":7010},{"text":"One I'm going to show an example of is Kaggle.","startMs":2099390,"durationMs":5740},{"text":"So Kaggle doesn't just have competitions but it also has a cloud notebook server and I've got quite a few examples there.","startMs":2105150,"durationMs":10180},{"text":"So let me give you a quick example of how we use Jupyter notebooks.","startMs":2118830,"durationMs":4460},{"text":"To... to... to build stuff, to... to experiment, to explore.","startMs":2123990,"durationMs":4019.9999999999995},{"text":"So on kaggle, if you start with somebody else's notebook... so why don't you start with this one Jupyter notebook 101.","startMs":2128510,"durationMs":5740},{"text":"If it's your own notebook you'll see a button called edit.","startMs":2135390,"durationMs":2430},{"text":"If it's somebody else's, that button will say copy and edit.","startMs":2137820,"durationMs":3110},{"text":"If you use somebody's notebook that you like, make sure you click the upvote button to encourage them and to help other people find it before you go ahead and copy and edit.","startMs":2142230,"durationMs":8940},{"text":"And once we're in edit mode we can now use this notebook and to use it we can type in any arbitrary expression in python and click run and the very first time","startMs":2151870,"durationMs":15030},{"text":"we do that it says session is starting it's basically launching a virtual computer for us to run our code.","startMs":2166900,"durationMs":5840},{"text":"This is all free.","startMs":2172740,"durationMs":1110},{"text":"In a sense, it's like the world's most powerful calculator.","startMs":2175670,"durationMs":3980},{"text":"It's a calculator where you have all of the capabilities of the world's I think most popular programming language – certainly it and javascript would be the top two – directly at your disposal.","startMs":2180070,"durationMs":12470},{"text":"So, python does know how to do one plus one, and so you can see here it spits out the answer.","startMs":2192540,"durationMs":4790},{"text":"I hate clicking","startMs":2197870,"durationMs":1110},{"text":"I always use keyboard shortcuts so instead of clicking this little arrow, you just press shift enter to do the same thing","startMs":2198980,"durationMs":6110},{"text":"but as you can see there's not just calculations here, there's also prose, and so jupyter notebooks are great for explaining to you the version of yourself in six months time, what on earth you were doing, or to your co workers, or the","startMs":2206470,"durationMs":14950},{"text":"people in the open source community, or the people you're blogging for etc,","startMs":2221420,"durationMs":3310},{"text":"and so you just type prose,","startMs":2225230,"durationMs":2420},{"text":"and as you can see when we create a new cell, you can create a code cell which is a cell that lets you type calculations, or a markdown cell which is a cell that lets you create prose.","startMs":2228590,"durationMs":13140},{"text":"And the prose uses formatting in a little mini language called “ markdown”.","startMs":2244470,"durationMs":4290},{"text":"There's so many tutorials around I won't explain it to you but it lets you do things like links and so forth.","startMs":2248760,"durationMs":7850},{"text":"So I'll let you follow through the tutorial in your own time because it really explains to you what to do.","startMs":2260110,"durationMs":7460},{"text":"One thing to point out is that sometimes you'll see me use cells with an exclamation mark at the start.","startMs":2267910,"durationMs":4860},{"text":"That's not Python, that's a bash shell command, okay?","startMs":2273150,"durationMs":4470},{"text":"so that's what the exclamation mark means.","startMs":2277620,"durationMs":2310},{"text":"As you can see you can put images into notebooks, and so the image I popped in here was the one showing that Jupyter won the 2017 software system award which is pretty much the biggest award there is for this kind of software.","startMs":2282630,"durationMs":13460},{"text":"Okay, so that's the basic idea of how we use notebooks.","startMs":2296630,"durationMs":4420},{"text":"So let's have a look at how we do our bird or not bird model.","startMs":2305830,"durationMs":4820},{"text":"One thing I always like to do when I'm using something like colab or kaggle cloud, cloud platforms that I'm not controlling is, make sure that I'm using the most recent version of any software.","startMs":2316030,"durationMs":10060},{"text":"So my first cell here is exclamation mark pip install minus u , q fast.","startMs":2326350,"durationMs":7210},{"text":"ai.","startMs":2333560,"durationMs":370},{"text":"So that makes sure that we have the latest version of fast.","startMs":2334310,"durationMs":2410},{"text":"ai, and if you always have that at the start of your notebooks you're never going to have those awkward forum threads where you say “ why isn't this working?” and somebody says to you “ oh you're using an old version of some software!”","startMs":2336720,"durationMs":9930},{"text":"So, you'll see here this notebook is the exact thing that I was showing you at the start of this lesson,","startMs":2349590,"durationMs":7900},{"text":"So, if you haven't done much python, you might be surprised about how little code there is here, and so python","startMs":2361790,"durationMs":15230},{"text":"is a concise but not too concise language.","startMs":2377020,"durationMs":4070.0000000000005},{"text":"You'll see that there's less boilerplate than some other languages you might be familiar with, and I'm also taking advantage of a lot of libraries so fast.","startMs":2381310,"durationMs":8650},{"text":"ai provides a lot of convenient things for you.","startMs":2389960,"durationMs":2610},{"text":"Oh I forgot to import… So, to use a external library we use import to “ import a symbol from a library”.","startMs":2395310,"durationMs":15100},{"text":"fast.","startMs":2411110,"durationMs":490},{"text":"ai has a lot of libraries we provide.","startMs":2411600,"durationMs":2060},{"text":"They generally start with “ fast something” so for example to make it easy to download a url, “ fastdownload” has download_ url().","startMs":2413660,"durationMs":7150},{"text":"To make it easy to create a thumbnail, we have Image.","startMs":2421750,"durationMs":4170},{"text":"to_ thumb() and so forth.","startMs":2425920,"durationMs":2370},{"text":"So, I always like to view – as I'm building a model – my data at every step.","startMs":2430150,"durationMs":7410},{"text":"So that's why I first of all grab one bird, and then I grab one forest photo, and I look at them to make sure they look reasonable.","startMs":2437560,"durationMs":9210},{"text":"And once I think, “ okay they look okay”, then I go ahead and download.","startMs":2449150,"durationMs":7140},{"text":"And, so, you can see fast.","startMs":2458270,"durationMs":1170},{"text":"ai has a download_ images() where you just provide a list of urls so that's how easy it is, and it does that in parallel.","startMs":2459440,"durationMs":8090},{"text":"So it does that, you know, surprisingly quickly.","startMs":2467710,"durationMs":3300},{"text":"One other fast.","startMs":2472710,"durationMs":870},{"text":"ai thing I'm using here is resize_ images().","startMs":2473580,"durationMs":1990},{"text":"You generally… you'll find that for computer vision algorithms you don't need particularly big images, so I'm resizing these to a maximum size length of 400 because it just… it's actually much faster because gpus are so quick","startMs":2477430,"durationMs":14780},{"text":"for big images, most of the time can be taken up just opening it.","startMs":2493070,"durationMs":3900},{"text":"The neural net itself often takes less time.","startMs":2497510,"durationMs":2660},{"text":"So that's another good reason to make them smaller.","startMs":2500470,"durationMs":2220},{"text":"Okay, so the main thing I wanted to tell you about was this data block command.","startMs":2505310,"durationMs":5860},{"text":"So the data block is the key thing that you're going to want to get familiar with as deep learning practitioners at the start of your journey because the main thing you're going to be trying to figure out is how do I get this data","startMs":2511190,"durationMs":14940},{"text":"into my model?","startMs":2526830,"durationMs":1140},{"text":"Now that might surprise you.","startMs":2528230,"durationMs":1510},{"text":"You might be thinking we should be spending all of our time talking about neural network architectures, and matrix multiplication and gradients and stuff like that, the truth is very little of that comes up in practice, and","startMs":2529740,"durationMs":15220},{"text":"the reason is, that at this point the deep learning community has found a reasonably small number of types of model that work for nearly all the main applications you'll need;","startMs":2544960,"durationMs":14370},{"text":"and fast.","startMs":2560110,"durationMs":750},{"text":"ai will create the right type of model for you the vast majority of the time.","startMs":2560860,"durationMs":5230},{"text":"So all of that stuff about tweaking neural network architectures and stuff… I mean we'll get to it eventually in this course but you might be surprised to discover that it almost never comes up.","startMs":2566950,"durationMs":14370},{"text":"Kind of like if you ever did like a computer science course or something and they spent all this time on the details of compilers and operating systems, and then you get to the real world and you never use it again.","startMs":2581320,"durationMs":9930},{"text":"So this course is called practical deep learning, and so we're going to focus on the stuff that is practically important.","startMs":2591830,"durationMs":5980},{"text":"Okay, so our images have finished downloading, and two of them were broken so we just deleted them.","startMs":2598670,"durationMs":8740},{"text":"Another thing you'll note by the way if you're a keen software engineer is, I tend to use a lot of functional style in my programs","startMs":2609830,"durationMs":9670},{"text":"I find for kind of the kind of work I do that a functional style works very well if you're, you know a lot of people in python are less familiar with, that it's more, maybe comes, more from other things.","startMs":2619500,"durationMs":11510},{"text":"So yeah that's why you'll see me using stuff like map and stuff quite a lot.","startMs":2631510,"durationMs":3580},{"text":"Alright so a data block is the key thing you need to know about if you're going to know how to use different kinds of data sets, and so these are all of the things, basically, that you'll be providing.","startMs":2636070,"durationMs":12260},{"text":"And so what we did when we designed the data block was we actually looked and said “ okay over hundreds of projects what are all the things that change from project to project to get the data into the right shape”?,","startMs":2648350,"durationMs":15100},{"text":"and we realized we could basically split it down into these five things.","startMs":2663510,"durationMs":2980},{"text":"So the first thing that we tell fast.","startMs":2668430,"durationMs":2450},{"text":"ai is “ what kind of input do we have”?, and so then, so there are lots of blocks in fast.","startMs":2670880,"durationMs":6000},{"text":"ai for different kinds of inputs so we said “ ah, the input is an image! ; “ what kind of output is there?”, “ what kind of label?.” The output's a category, so that means it's one of a number of possibilities.","startMs":2676880,"durationMs":11090},{"text":"So that's enough for fast.","startMs":2689630,"durationMs":1450},{"text":"ai to know what kind of model to build for you.","startMs":2691080,"durationMs":2850},{"text":"So what are the items in this model?","startMs":2695550,"durationMs":1610},{"text":"what am I actually going to be looking at to look to train from?","startMs":2697160,"durationMs":2250},{"text":"this is a function!","startMs":2700550,"durationMs":1180},{"text":"In fact you might have noticed if you were looking carefully that we use this function here.","startMs":2702030,"durationMs":4700},{"text":"It's a function which returns a list of all of the image files in a path based on extension, so every time it's going to try and find out what things to train from, it's going to use that function.","startMs":2708030,"durationMs":12830},{"text":"In this case we'll get a list of image files.","startMs":2720860,"durationMs":1950},{"text":"Something we'll talk about shortly is that it's critical that you put aside some data for testing the accuracy of your model that's called a “ validation set.” It's so critical that fast.","startMs":2724470,"durationMs":12770},{"text":"ai won't let you train a model without one, so you actually have to tell it how to create a validation set, how to set aside some data, and in this case we say “ randomly, set aside 20 % of the data.”","startMs":2737240,"durationMs":13770},{"text":"Okay, next question, then you have to tell fast.","startMs":2753350,"durationMs":3690},{"text":"ai is “ how do we know the correct label of a photo”, how do we know if it's a bird photo or a forest photo?","startMs":2757040,"durationMs":7530},{"text":"and this is another function, and this function simply returns the parent folder of of a path and so in this case we saved our images into either","startMs":2765470,"durationMs":15820},{"text":"forest or bird.","startMs":2781350,"durationMs":1380},{"text":"So that's where the labels are going to come from","startMs":2782790,"durationMs":1900},{"text":"And then finally, most computer vision architectures need all of your inputs as you train to be the same size, so “ item transforms” are all of the bits","startMs":2786670,"durationMs":15150},{"text":"of code that are gonna run on every item, on every image in this case, and we're saying okay we want you to resize each of them to being 192 by 192 pixels.","startMs":2801820,"durationMs":11990},{"text":"There's two ways you can resize: you can either crop out a piece in the middle, or you can squish it, and so we're saying “ squish it”.","startMs":2814390,"durationMs":9340},{"text":"So that's the data block that's all that you need, and from there we create an important class called data loaders.","startMs":2825590,"durationMs":7220},{"text":"Data loaders are the things that, actually, pytorch iterates through to grab a bunch of your data at a time.","startMs":2832870,"durationMs":7260},{"text":"The way it can do it so fast is by using a GPU which is something that can do thousands of things at the same time and that means it needs thousands of things to do at the same time","startMs":2840790,"durationMs":10180},{"text":"so a data loader will feed the training algorithm with a “ bunch” of your images at once; in fact we don't call it a bunch we call it a “ batch” or a “ mini batch”.","startMs":2851630,"durationMs":12780},{"text":"And so, when we say show “ batch” that's actually a very specific word in deep learning.","startMs":2866510,"durationMs":8010},{"text":"It's saying show me an example of a batch of data that you would be passing into the model, and so you can see showbatch gives you – tells you – two things: the input which is the picture, and the label, and remember!","startMs":2874520,"durationMs":14640},{"text":"the label came by calling that function.","startMs":2889160,"durationMs":3530},{"text":"So, when you come to building your own models you'll be wanting to know what kind of splitters are there?","startMs":2894110,"durationMs":8010},{"text":"what kinds of labeling functions are there?","startMs":2902120,"durationMs":1660},{"text":"and so forth what's wrong button you'll be wanting to know what kind of labeling functions are there and what kind of splitters are there and so forth and so docs.","startMs":2903780,"durationMs":9740},{"text":"fast.","startMs":2913520,"durationMs":440},{"text":"ai is where you go to get that information.","startMs":2913960,"durationMs":2890},{"text":"Often the best place to go is to choose the tutorials.","startMs":2917270,"durationMs":2980},{"text":"So for example here's a whole data block tutorial, and there's lots and lots of examples, so hopefully you can start out by finding something that's similar to what you want to do and see how we did it, but then of course","startMs":2922070,"durationMs":15130},{"text":"there's also the underlying api information so here's data blocks!","startMs":2937200,"durationMs":7170},{"text":"Okay.","startMs":2946350,"durationMs":620},{"text":"How are we doing?","startMs":2949270,"durationMs":940},{"text":"Still doing good!","startMs":2951790,"durationMs":1010},{"text":"Alright.","startMs":2952800,"durationMs":810},{"text":"So at the end of all this we've got an object called “ dls” that stand for “ data loaders” and that contains iterators that pytorch can run through to grab batches of randomly split out","startMs":2957390,"durationMs":14420},{"text":"training images to train the model with, and validation images to test the model with.","startMs":2972510,"durationMs":5100},{"text":"So now we need a model.","startMs":2979470,"durationMs":1340},{"text":"The critical concept here in fastai is called a “ learner”.","startMs":2982510,"durationMs":3460},{"text":"A “ learner” is something which combines a model, which is, that is, the actual neural network function we’ll be training, and the data we use to train it with; and that's why you have to pass in two things: the data which is the data","startMs":2986150,"durationMs":15130},{"text":"loaders object, and a model.","startMs":3001280,"durationMs":3690},{"text":"And so the model is going to be the actual neural network function that you want to pass in, and as I said there's a relatively small number that basically work for the vast majority of things you do.","startMs":3005150,"durationMs":14300},{"text":"If you pass in just a bare symbol like this it's going to be one of fast.","startMs":3021390,"durationMs":3850},{"text":"ai's built in models but what's particularly interesting is that we integrate a wonderful library by Ross Wightman called “ timm” which is the largest collection of computer vision models in the world, and","startMs":3025240,"durationMs":15280},{"text":"at this point fast.","startMs":3040520,"durationMs":740},{"text":"ai is the first and only framework to integrate this.","startMs":3041260,"durationMs":3720},{"text":"So you can use any one of the pytorch image models and one of our students Amanamoro was kind enough to create this fantastic documentation where you can find out all about the different models.","startMs":3044980,"durationMs":15270},{"text":"And if we click on here, you can get lots and lots of information about all the different models that Ross has provided.","startMs":3062630,"durationMs":8860},{"text":"Having said that, the model family called “ resnet” are probably going to be fine for nearly all the things you want to do, but it is fun to try different models out so you can type in any string","startMs":3072710,"durationMs":15500},{"text":"here to use any one of those other models","startMs":3088310,"durationMs":4340},{"text":"Okay so if we run that, let's see what happens okay?","startMs":3095830,"durationMs":4510},{"text":"So this is interesting…","startMs":3100340,"durationMs":740},{"text":"So when I ran this… so, remember on kaggle it's creating a new virtual computer for us, so it doesn't really have anything ready to go, so when I ran this the first thing it did was it said “ downloading resnet 18. pth”","startMs":3101080,"durationMs":14570},{"text":"What's that?","startMs":3116150,"durationMs":860},{"text":"well, the reason we can do this so fast is, because somebody else has already trained this model to recognize over 1 million images of over 1 000 different types; something called the “ ImageNet”","startMs":3117390,"durationMs":15310},{"text":"dataset, and they then made those weights available – those parameters– available on the internet for anybody to download.","startMs":3132700,"durationMs":9470},{"text":"By default on fast.","startMs":3142550,"durationMs":2070},{"text":"ai when you ask for a model, we will download those weights for you, so that you don't start with a random network that can't do anything.","startMs":3144620,"durationMs":9590},{"text":"You actually start with a network that can do an awful lot, and so, then something that fast.","startMs":3154310,"durationMs":5870},{"text":"ai has, that's unique, is this fine_ tune method, which, what it does is:","startMs":3160180,"durationMs":4960},{"text":"it takes those pre trained weights we downloaded for you, and it adjusts them in a really carefully controlled way to just teach the model the differences between your data set, and what it was originally trained for.","startMs":3165140,"durationMs":15390},{"text":"That's called “ fine tuning”; hence the name.","startMs":3180790,"durationMs":3220},{"text":"So that's why you'll see this downloading happen first, and so as you can see at the end of it, this is the error right here after a few seconds it's a 100 % accurate","startMs":3185070,"durationMs":11620},{"text":"So we now have a learner, and this learner has been, has started with, a pre trained model that's been fine tuned for the purpose of recognizing bird pictures from forest pictures.","startMs":3201430,"durationMs":11980},{"text":"So you can now call dot predict on it, and dot predict you pass in an image, and so this is how you would then deploy your model.","startMs":3215430,"durationMs":13870},{"text":"So in the code you have whatever it needs to do.","startMs":3229300,"durationMs":2950},{"text":"So in this particular case this person had some reason that he needs the app to check whether they're in the national park, and whether it's a photo of a bird, so at the vet where they need to know if it's a photo of a bird it would just","startMs":3233590,"durationMs":13150},{"text":"call this one line of code learn.","startMs":3246740,"durationMs":3920},{"text":"predict(); and so that's going to return whether it's a bird or not as a string, whether it's a bird or not as an integer, and the probability that it's a non bird or a bird; and so that's why we can print these things out.","startMs":3250660,"durationMs":14830},{"text":"Okay so that's how we can create a computer vision model.","startMs":3267630,"durationMs":6940},{"text":"What about other kinds of models?","startMs":3277710,"durationMs":1770},{"text":"right?","startMs":3279480,"durationMs":360},{"text":"There's a lot more in the world than just computer vision.","startMs":3279840,"durationMs":2090},{"text":"A lot more than just image recognition.","startMs":3282950,"durationMs":1990},{"text":"Well even within computer vision, there's a lot more than just image recognition.","startMs":3284940,"durationMs":4470},{"text":"For example, for example, there's segmentation!","startMs":3290830,"durationMs":8780},{"text":"So segmentation, maybe the best way to explain segmentation is to show you the result of this model.","startMs":3303470,"durationMs":4300},{"text":"Segmentation is where we take photos – in this case of road scenes – and we color in every pixel according to what it's a, what is it.","startMs":3308990,"durationMs":11940},{"text":"So in this case we've got brown as cars, blue is fences I guess?","startMs":3321230,"durationMs":4650},{"text":"red is buildings?","startMs":3325880,"durationMs":1050},{"text":"or brown?","startMs":3327030,"durationMs":900},{"text":"And so on the left here some photos that some somebody has already gone through, and classified every pixel of, every one of these images according to what that pixel is a pixel of, and then on the right is","startMs":3330230,"durationMs":15250},{"text":"what our model is guessing, and as you can see it's getting a lot of the pixels correct and some of them it’s getting wrong.","startMs":3345480,"durationMs":10490},{"text":"It's actually amazing how many is getting correct because this particular model I trained in about 20 seconds","startMs":3357510,"durationMs":15660},{"text":"using a tiny, tiny, tiny, amount of data.","startMs":3373510,"durationMs":2580},{"text":"So you know, again, like, you would think this would be a particularly challenging problem to solve, but it took about 20 seconds of training to solve it, not amazingly well, but pretty well.","startMs":3376270,"durationMs":13580},{"text":"If I trained it for another two minutes it'd probably be close to perfect.","startMs":3389910,"durationMs":5180},{"text":"So this is called “ segmentation”.","startMs":3395470,"durationMs":1620},{"text":"Now you'll see that there's very, very, little data required, and … sorry, very little CODE required, and the steps are actually going to look quite familiar.","startMs":3397110,"durationMs":11820},{"text":"In fact in this case we're using an even simpler approach.","startMs":3409070,"durationMs":2980},{"text":"Earlier on, we used “ data blocks”.","startMs":3412150,"durationMs":1910},{"text":"Data blocks are a kind of intermediate level very … flexible approach that you can take to handling almost any kind of data, but for the kinds of data that occur a lot, you","startMs":3414060,"durationMs":15220},{"text":"can use these special data loaders classes which kind of lets you use even less code.","startMs":3429280,"durationMs":6380},{"text":"So, in this case, to create data loaders for segmentation, you can just say: “ okay I'm going to pass you in a function for labeling”; and you can see here it's got pretty similar things that we pass in, to what we passed in for data blocks before.","startMs":3435660,"durationMs":15190},{"text":"So our file names is get_ image_ files() again, and then our label function is something that grabs this path, and the codes.","startMs":3451150,"durationMs":11690},{"text":"So the labels for further segmentation, sorry, the codes.","startMs":3462840,"durationMs":5300},{"text":"So, like, “ what does each code mean?” is going to be this text file, but you can see the basic information we're providing is very very similar regardless of whether we're doing segmentation or object recognition; and then the next steps","startMs":3468140,"durationMs":15220},{"text":"are pretty much the same.","startMs":3483360,"durationMs":700},{"text":"We create a learner for segmentation.","startMs":3484060,"durationMs":2400},{"text":"We create, so, we've got a UNet learner which we'll learn about later, and then again, we call fine_ tune() so that is it!","startMs":3486460,"durationMs":7550},{"text":"and that's how we create a segmentation model!","startMs":3494830,"durationMs":2380},{"text":"What about stepping away from computer vision?","startMs":3499110,"durationMs":2450},{"text":"So perhaps the most widely used kind of model used in industry is tabular analysis.","startMs":3501560,"durationMs":6180},{"text":"So, taking things like spreadsheets and database tables, and trying to predict columns of those.","startMs":3507740,"durationMs":4150},{"text":"So, in tabular analysis, it really looks very similar to what we've seen already, We grabbed some data and you'll see when I call this untar_ data(), this is the thing in fast.","startMs":3517510,"durationMs":12570},{"text":"ai that downloads some data and decompresses it for you and there's a whole lot of urls provided by fast.","startMs":3530080,"durationMs":5240},{"text":"ai for all the, kind of common data sets that you might want to use; you know all the ones that are in the book?","startMs":3535320,"durationMs":6370},{"text":"or lots of data sets that are kind of widely used in learning and research?","startMs":3542070,"durationMs":3580},{"text":"So, it makes life nice and easy for you.","startMs":3546190,"durationMs":2020},{"text":"So again, we're going to create data loaders, but this time it's tabular data loaders, but we provide pretty similar kind of information to what we have before.","startMs":3548630,"durationMs":7340},{"text":"Couple of new things we have to tell it. “ Which of the columns are categorical?” so they can only take one of a few values, and “ which ones are continuous” so they can take, basically, any real number, and then again, we can use the","startMs":3556670,"durationMs":15030},{"text":"exact same show_ batch() that we've seen before, to see the data, and so, fast.","startMs":3571700,"durationMs":6920},{"text":"ai uses a lot of something called “ type dispatch” which is a system that's particularly popular in in a language called Julia, to basically, automatically, do the right thing for your data, regardless of what kind of data it is.","startMs":3578620,"durationMs":14470},{"text":"So, if you call show_ batch() on something you should go get back something “ useful” regardless of what kind of information you provided.","startMs":3593190,"durationMs":6380},{"text":"So for a table it shows you on the information in that table.","startMs":3599630,"durationMs":5380},{"text":"This particular data set is a data set of whether people have less than fifty thousand dollars or more than fifty thousand dollars in salary for different districts based on demographic information in each district.","startMs":3605230,"durationMs":15220},{"text":"So, to build a model for that data loader, we do as always “ something” underscore “ learner”.","startMs":3623550,"durationMs":8260},{"text":"In this case it's a tabular learner.","startMs":3631910,"durationMs":1780},{"text":"Now this time we don't say: “ fine_ tune()”; we say “ fit”.","startMs":3635070,"durationMs":3370},{"text":"Specifically, fit_ one_ cycle().","startMs":3638440,"durationMs":1610},{"text":"That's because for tabular models, there's not generally going to be a pre trained model that already does something like what you want, because every table of data is very different, whereas pictures often have a similar theme, you know?","startMs":3640590,"durationMs":13690},{"text":"They're all pictures.","startMs":3654280,"durationMs":700},{"text":"They all have the same kind of “ general idea” of what pictures are.","startMs":3654980,"durationMs":3030},{"text":"So that's why it generally doesn't make too much sense to fine tune a tabular model.","startMs":3658670,"durationMs":5290},{"text":"So instead, you just fit.","startMs":3663960,"durationMs":1450},{"text":"So there's one difference there.","startMs":3666390,"durationMs":1500},{"text":"I'll show another example.","startMs":3668990,"durationMs":1500},{"text":"Okay, so, collaborative filtering. “ Collaborative filtering” is the basis of most recommendation systems today.","startMs":3672550,"durationMs":11810},{"text":"It's a system where we basically take data set that says: which users liked which products, or which users used which products, and then we use that to guess what other products those","startMs":3684360,"durationMs":15040},{"text":"users might like based on finding similar users, and what those similar users like.","startMs":3699400,"durationMs":4730},{"text":"The interesting thing about collaborative filtering is that when we say “ similar users,” we're not referring to similar demographically, but similar in the sense of people who liked the same kinds of products.","startMs":3704750,"durationMs":14940},{"text":"So, for example, if you use any of the music systems like Spotify, or Apple music, or whatever, it'll ask you first, like, “ what's a few pieces of music you like,” and you tell it, and then it says “ okay well maybe","startMs":3720230,"durationMs":15380},{"text":"let's start playing this music for you,” and that's how it works.","startMs":3735630,"durationMs":3850},{"text":"It uses collaborative filtering.","startMs":3739480,"durationMs":1410},{"text":"So we can create a collaborative filtering data loaders in exactly the same way that we're used to, by downloading and decompressing some data, create our collab data loaders.","startMs":3741390,"durationMs":13900},{"text":"In this case we can just save from csv, and pass in a csv, and this is what collaborative filtering data looks like.","startMs":3755310,"durationMs":6130},{"text":"It's going to have, generally speaking, a user id, some kind of product id; in this case, a movie, and a rating.","startMs":3761440,"durationMs":8170},{"text":"So, in this case this user gave this movie a rating of 3.5 out of 5, and so, again, you can see show_ batch, right?","startMs":3771430,"durationMs":8950},{"text":"So use show batch.","startMs":3780380,"durationMs":920},{"text":"You should get back some useful visualization of your data regardless of what kind of data it is, and so again, we create a “ learner.” This time the “ collaborative filtering” learner,","startMs":3781300,"durationMs":15070},{"text":"and you pass in your data.","startMs":3796430,"durationMs":2340},{"text":"In this case we give it one extra piece of information, which is – because this is not predicting a category, but it's predicting a real number – we tell it: “ what's the possible range.”","startMs":3800630,"durationMs":10140},{"text":"The actual range is one to five, but for reasons you'll learn about later, it's a good idea to actually go from a little bit lower than the possible minimum, to a little bit higher.","startMs":3811430,"durationMs":9890},{"text":"That's why I say 0.5 to 5.5, and then fine tune.","startMs":3821320,"durationMs":4820},{"text":"Now, again, you know we don't really need to fine tune here because there's not really such a thing as a pre trained collaborative filtering model.","startMs":3826140,"durationMs":5640},{"text":"We could just say “ fit” or “ fit_ one_ cycle”, but actually fine_ tune() works fine as well.","startMs":3831780,"durationMs":4430},{"text":"So, after we train it for a while, this here is the “ mean squared error”, so it's basically, that: “ on average how far off are we for the validation set”.","startMs":3837430,"durationMs":12020},{"text":"And you can see as we train, and it's literally so fast ( it's less than a second each epoch) that error goes down and down, and","startMs":3849590,"durationMs":9500},{"text":"for any kind of fast.","startMs":3865990,"durationMs":1050},{"text":"ai model you can always call show_ results() , and get something sensible.","startMs":3867040,"durationMs":3780},{"text":"So in this case it's going to show a few examples of users and movies.","startMs":3870820,"durationMs":3310},{"text":"Here's the actual rating that user gave that movie and here's the rating that the model predicted.","startMs":3874350,"durationMs":6060},{"text":"Okay, so, apparently a lot of people on the forum are asking how I'm turning this notebook into a presentation?","startMs":3882070,"durationMs":6740},{"text":"So, I'll be delighted to show you, because I'm very pleased that these people made this thing for free for us to use.","startMs":3890990,"durationMs":5220},{"text":"It's called “ Rise”, and all I do is, it's a notebook extension, and in your notebook it gives you an extra little thing on the side where you say which things are slides, or which things are fragments,","startMs":3896230,"durationMs":15580},{"text":"and a fragment just being… so, this is a slide, that's a fragment.","startMs":3912190,"durationMs":2870},{"text":"So if I do that you'll see it starts with a slide and then the fragment gets added in.","startMs":3915060,"durationMs":6790},{"text":"Yeah, that's about all there is to it!","startMs":3924990,"durationMs":1670},{"text":"Actually it's pretty great, and it's very well documented.","startMs":3926660,"durationMs":2520},{"text":"You know I'll just mention, like what do I make with Jupyter notebooks: this entire book was written entirely in Jupyter notebooks.","startMs":3929180,"durationMs":14950},{"text":"Here are the notebooks.","startMs":3947070,"durationMs":1300},{"text":"So if you go to the fastai fastbook repo…","startMs":3949190,"durationMs":1530},{"text":"if you go to the fastai fastbook repo, you can read the whole book, and because it's all in notebooks, every time we say: “ here's how you create this plot,” or “ here's how you train this model,” you can actually create the plot, or you","startMs":3950720,"durationMs":14120},{"text":"can actually train the model, because it's all notebooks.","startMs":3964840,"durationMs":4170},{"text":"The entire fast.","startMs":3974670,"durationMs":950},{"text":"ai library is actually written in notebooks.","startMs":3975620,"durationMs":2950},{"text":"So you might be surprised to discover that if you go to fast.","startMs":3979030,"durationMs":2670},{"text":"ai fast.","startMs":3981700,"durationMs":800},{"text":"ai that the source code for the entire library is notebooks,","startMs":3982500,"durationMs":10630},{"text":"and so the nice thing about this is that, you know, the source code for the fast.","startMs":3998550,"durationMs":4510},{"text":"ai library has actual pictures of the actual things that we're building for example.","startMs":4003060,"durationMs":4590},{"text":"What else have we done with notebooks?","startMs":4011110,"durationMs":1590},{"text":"oh!","startMs":4012700,"durationMs":470},{"text":"blogging!","startMs":4015430,"durationMs":780},{"text":"I love blogging with notebooks, because when I want to explain something I just write the code, and you can just see the outputs, and it all just works.","startMs":4018190,"durationMs":10980},{"text":"Another thing you might be surprised by, is all of our tests and continuous integration are also all in notebooks.","startMs":4032830,"durationMs":7060},{"text":"So every time we change one of our notebooks… every time we change one of our notebooks, hundreds of tests get run automatically,","startMs":4039990,"durationMs":14380},{"text":"in parallel, and if there's any issues we will find out about it.","startMs":4055590,"durationMs":4580},{"text":"So, yeah, notebooks are great!","startMs":4060590,"durationMs":1430},{"text":"and rise is… is a really nice way to do slides in notebooks.","startMs":4062020,"durationMs":5870},{"text":"Alright.","startMs":4071310,"durationMs":860},{"text":"So, what can deep learning do at present?","startMs":4074950,"durationMs":3420},{"text":"We're still scratching this the tip of the iceberg even though it's a pretty well hyped you know heavily marketed technology this pro… you know when we started in 2014 or so, you know, not many people were","startMs":4080430,"durationMs":15250},{"text":"talking about deep learning, and really there was no accessible way to get started with it.","startMs":4095680,"durationMs":5480},{"text":"There were no pre trained models you could download, you know.","startMs":4101160,"durationMs":4290},{"text":"There was just starting to appear some of the first open source software that would run on gpus, but yeah, I mean, but despite the fact that today there's a lot of people talking about deep learning, we're just scratching the surface.","startMs":4106029.9999999995,"durationMs":12820},{"text":"Every time pretty much somebody says to me I work in domain x, and I thought I might try deep learning out to see if it can help, and I see them a few months later, and I say “ how did it go?”","startMs":4119470.0000000005,"durationMs":10310},{"text":"they nearly always say: “ well we just broke the state of the art results in our field.”","startMs":4129779.9999999995,"durationMs":3470},{"text":"So, you know, when I say these are things that it's currently state of the art for – these are kind of the ones that people have tried so far but still, most things haven't been tried.","startMs":4134149.9999999995,"durationMs":8020},{"text":"So, in NLP, deep learning is the state of the art method in all these kinds of things and a lot more; computer vision, medicine, biology","startMs":4142430.0000000005,"durationMs":14940},{"text":"recommendation systems, playing games, robotics…","startMs":4160990,"durationMs":3620},{"text":"I mean it's just… I've tried… I've tried elsewhere to make bigger lists, and I just end up with pages and pages and pages!","startMs":4165029.9999999995,"durationMs":6660},{"text":"so yeah it's…","startMs":4171710,"durationMs":2330},{"text":"it's generally speaking","startMs":4174040,"durationMs":3520},{"text":"you know, if it's something that a human can do reasonably quickly, like look at a go board and decide if it looks like a good go board or not, even if it needs to be an ex","startMs":4177560.0000000005,"durationMs":13010},{"text":"even… if it needs to be an expert human, then that's probably something that deep learning will be pretty good at.","startMs":4190950,"durationMs":6420},{"text":"If it's something that takes a lot of logical thought processes over an extended period of time, you know, particularly if it's not based on much data, maybe not.","startMs":4198230,"durationMs":11230},{"text":"You know, like, “ who's going to win the next election”, or something like that.","startMs":4209460,"durationMs":4270},{"text":"That'd be kind of broadly how I try to decide: is your thing useful for deep… you know, good for deep learning or not.","startMs":4214110,"durationMs":5620},{"text":"You know it's been a long time to get to this point.","startMs":4221430,"durationMs":2620},{"text":"Yes, deep learning is incredibly powerful now, but it's taken decades of work.","startMs":4226030,"durationMs":5620},{"text":"This was the first neural network.","startMs":4231750,"durationMs":1690},{"text":"Remember, neural networks are the basis of deep learning.","startMs":4233440,"durationMs":2330},{"text":"So this was back in 1957.","startMs":4236270,"durationMs":3380},{"text":"The basic ideas have not changed much at all, but you know we do have things like gpus now, and solid state drives, and stuff like that, and of course much more data,","startMs":4241150,"durationMs":15050},{"text":"just is available, now, but this has been decades of really hard work by a lot of people to get to this point.","startMs":4256200,"durationMs":10650},{"text":"So let's kind of take a step back, and talk about, like, what's what's going on in these models, and I'm going to describe the basic idea of machine learning","startMs":4271150,"durationMs":15180},{"text":"largely as it was described by Arthur Samuel in the late 50s when it was invented, and I'm going to kind of do it with these graphs;","startMs":4286910,"durationMs":10660},{"text":"oh which, by the way, you might find fun… these graphs are themselves… created with Jupyter notebooks.","startMs":4298830,"durationMs":14990},{"text":"So these are graphviz descriptions that are going to get turned into these, so there's a little sneak peek behind the scenes for you?","startMs":4313820,"durationMs":7430},{"text":"So, let's start with kind of a graph of, like, well, what does a normal program look like?","startMs":4323830,"durationMs":3710},{"text":"right?","startMs":4327540,"durationMs":300},{"text":"so, in the pre deep learning, and machine learning days, well, you know, you'd have… you still have inputs, and you still have results.","startMs":4327840,"durationMs":6480},{"text":"Right?","startMs":4334320,"durationMs":440},{"text":"and then you code a program in the middle, which is, you know, a bunch of conditionals, and loops, and setting variables, and blah blah blah.","startMs":4334760,"durationMs":6850},{"text":"Okay.","startMs":4342030,"durationMs":620},{"text":"A “ machine learning model” doesn't look that different… but…","startMs":4344110,"durationMs":6860},{"text":"The program has been replaced with something called “ a model,” and we don't just have inputs now, we now also have weights, which are also called “ parameters,” and the key thing is this: the model is not any more a bunch of conditionals,","startMs":4353750,"durationMs":15550},{"text":"and loops, and things.","startMs":4369300,"durationMs":990},{"text":"It's a mathematical function.","startMs":4370710,"durationMs":1660},{"text":"In the case of a neural network, it's a mathematical function that takes the inputs, multiplies them together by the weights – by one set of weights – and adds them up; and then it does that again for a second set of weights and adds them","startMs":4372510,"durationMs":13150},{"text":"up, does it again for a third set of weights, and adds them up and so forth.","startMs":4385660,"durationMs":2950},{"text":"It then takes all the negative numbers, and replaces them with zeros, and then it takes those as inputs to the next layer.","startMs":4389430,"durationMs":8550},{"text":"It does the same thing; multiplies them a bunch of times, and adds them up, and it does that a few times, and that's called “ a neural network.”","startMs":4397980,"durationMs":7390},{"text":"Now, the model therefore, is not going to do anything useful, unless these weights are very carefully chosen.","startMs":4406710,"durationMs":8140.000000000001},{"text":"And, so the way it works is, that we actually start out with these weights as being random.","startMs":4416550,"durationMs":5140},{"text":"So initially, this thing doesn't do anything useful at all!","startMs":4422310,"durationMs":5460},{"text":"So, what we do –- the way arthur samuel described it back in the late 50s is, he said: “ okay, let's take the inputs, and the weights, put them through our model.” He wasn't talking particularly about neural networks.","startMs":4432230,"durationMs":12930},{"text":"He's just like… whatever model you like… get the results, and then let's decide how “ good” they are, right?","startMs":4445160,"durationMs":9900},{"text":"So, if for example, we're trying to decide: “ is this a picture of a bird?”","startMs":4455060,"durationMs":4510},{"text":"and the model said – which initially is random – says “ this isn't a bird,” and actually it IS a bird, we would say: “ oh you're wrong!”","startMs":4459910,"durationMs":7300},{"text":"So we then calculate “ the loss.”","startMs":4467590,"durationMs":2110},{"text":"So, the loss is a number that says how good were the results.","startMs":4469700,"durationMs":3550},{"text":"So that's all pretty straightforward, you know.","startMs":4475310,"durationMs":1610},{"text":"We could, for example, say oh what's the accuracy?","startMs":4476920,"durationMs":1920},{"text":"We could look at 100 photos and say which percentage of them did it get right.","startMs":4478840,"durationMs":3530},{"text":"No worries.","startMs":4483510,"durationMs":940},{"text":"Now the critical step is this arrow.","startMs":4485550,"durationMs":2860},{"text":"We need a way of updating the weights that is coming up with a new set of weights that are a bit better than the previous set.","startMs":4489070,"durationMs":8060.000000000001},{"text":"Okay.","startMs":4497790,"durationMs":620},{"text":"And by a bit better we mean it should make the loss get a little bit better.","startMs":4498430,"durationMs":6390},{"text":"So we've got this number that says how good is our model and initially it's terrible, right?","startMs":4504820,"durationMs":5980},{"text":"It's random.","startMs":4510800,"durationMs":970},{"text":"We need some mechanism of making a little bit better.","startMs":4512230,"durationMs":3140},{"text":"If we can just do that one thing then we just need to iterate this a few times.","startMs":4515750,"durationMs":5610},{"text":"Because each time we put in some more inputs and... and put in our weights and get our loss and use it to make it a little bit better, then if we make it a little bit better enough times, eventually it's going to get good.","startMs":4521360,"durationMs":11850},{"text":"Assuming that our model is flexible enough to represent the thing we want to do.","startMs":4534270,"durationMs":5580},{"text":"Now remember what I told you earlier about what a neural network is: which is basically multiplying things together and adding them up and replacing the negatives with zeros and you do that a few times, that is provably an infinitely","startMs":4540750,"durationMs":13370},{"text":"flexible function.","startMs":4554120,"durationMs":1050},{"text":"So it actually turns out that that incredibly simple sequence of steps, if you repeat it a few times, you do enough of them, can solve any computable function.","startMs":4555750,"durationMs":13020},{"text":"And something like generate an artwork based off somebody's twitter bio is an example of a computable function, right?","startMs":4568870,"durationMs":12260},{"text":"Or translate English to Chinese is an example of a computable function.","startMs":4581230,"durationMs":6100},{"text":"So they're not the kinds of normal functions you do in year eight math right but they are computable functions.","startMs":4587630,"durationMs":7380},{"text":"and so therefore if we can just create this step then and use the neural network as our model then we're good to go.","startMs":4595510,"durationMs":10820},{"text":"In theory we can solve anything given enough time and enough data and so that's exactly what we do.","startMs":4606830,"durationMs":10180},{"text":"And so once we've finished that training procedure we don't need the loss anymore and even the weights themselves, we can integrate them, kind of into the model, right?","startMs":4618550,"durationMs":12330},{"text":"We finish changing them so we can just say that's now fixed and so once we've done that we now have something which takes inputs, puts them through a model and gives us results.","startMs":4630880,"durationMs":9530},{"text":"It looks exactly like our original idea of a program and that's why we can do what I described earlier, that is once we've got that learn.","startMs":4641470,"durationMs":10790},{"text":"predict for our bird recognizer we can insert it into any piece of computer code, right?","startMs":4652260,"durationMs":5700},{"text":"Once we've got a trained model it's just another piece of code we can call with some inputs and get some outputs.","startMs":4657960,"durationMs":7170},{"text":"Deploying machine learning models in practice can come with a lot of, you know, little tricky details but the basic idea in your code is that you're just going to have a line of code that says learn.","startMs":4667110,"durationMs":14770},{"text":"predict and then you just fit it in with all the rest of your code in the usual way.","startMs":4681880,"durationMs":3500},{"text":"And this is why: because a trained model is just another thing that maps inputs to results.","startMs":4685380,"durationMs":6030},{"text":"Okay.","startMs":4695750,"durationMs":620},{"text":"All right.","startMs":4699950,"durationMs":610},{"text":"so as we come to wrap up this first lesson, for those of you that are already familiar with notebooks and Python, there's... you know... this has got to be pretty easy for you.","startMs":4700560,"durationMs":13890},{"text":"You're just going to be using some stuff that you're already familiar with and some slightly new libraries.","startMs":4715430,"durationMs":4390},{"text":"For those of you who are not familiar with Python, you know, you... you're biting into a big thing here.","startMs":4719820,"durationMs":6620},{"text":"There's obviously a lot you're going to have to learn and to be clear I'm...","startMs":4726440,"durationMs":5140},{"text":"I'm not going to be teaching Python in this course but we do have links to great python resources in the forum.","startMs":4731580,"durationMs":7230},{"text":"So check out... check out that thread.","startMs":4739190,"durationMs":2500},{"text":"Regardless of where you're at, the most important thing is to experiment and so experimenting could be as simple as just running those Kaggle notebooks that I've shown you","startMs":4743430,"durationMs":14780},{"text":"just to see them run.","startMs":4758710,"durationMs":1580},{"text":"You could try changing things a little bit.","startMs":4761350,"durationMs":1930},{"text":"I'd really love you to try doing the... the bird or forest exercise but come up with something else.","startMs":4763280,"durationMs":5490},{"text":"Maybe try to use three or four categories rather than two, you know.","startMs":4769150,"durationMs":3630},{"text":"Have a think about something that you think would be fun to try.","startMs":4772780,"durationMs":3470},{"text":"Depending on where you're at, you know, push yourself a little bit but not too much.","startMs":4778550,"durationMs":4990},{"text":"So make sure you get something finished before the next lesson.","startMs":4783540,"durationMs":3190},{"text":"Most importantly, read chapter one of the book.","startMs":4787510,"durationMs":3100},{"text":"It's got much the same stuff that we've seen today but presented in a slightly different way.","startMs":4791110,"durationMs":4500},{"text":"And then come back to the forums and present what you've done in the share your work here thread.","startMs":4796990,"durationMs":7500},{"text":"After the first time we did this in year one of the course we got over a thousand replies and of those replies it's amazing how many of them have ended up turning into new startups, scientific","startMs":4804910,"durationMs":15670},{"text":"papers, job offers.","startMs":4820580,"durationMs":2630},{"text":"It's been really cool to watch people's journeys and some of them are just plain fun, you know.","startMs":4823310,"durationMs":4070.0000000000005},{"text":"So this person classified different types of Trinidad and Tobago people.","startMs":4827380,"durationMs":4720},{"text":"So you know, people do stuff based on where they live and what their interests are.","startMs":4832100,"durationMs":3790},{"text":"I don't know if this person is particularly interested in zucchini and cucumber but they made a zucchini and cucumber classifier.","startMs":4835950,"durationMs":5580},{"text":"I thought this was a really interesting one: classifying satellite imagery into what city it's probably a picture of.","startMs":4841630,"durationMs":6220},{"text":"Amazingly accurate actually.","startMs":4848110,"durationMs":1350},{"text":"85 percent with 110 classes.","startMs":4849460,"durationMs":2310},{"text":"Panama city bus classifier.","startMs":4852350,"durationMs":2330},{"text":"Batik cloth classifier.","startMs":4854680,"durationMs":1690},{"text":"This one, you know, very practically important, you know, recognizing the state of buildings.","startMs":4858270,"durationMs":5620},{"text":"We've had quite a few students actually move into disaster resilience based on satellite imagery using exactly this kind of work.","startMs":4863990,"durationMs":6100},{"text":"We've already actually seen this example.","startMs":4871590,"durationMs":2060},{"text":"Ethan Sutin the... the sound classifier and I mentioned it was state of the art.","startMs":4873870,"durationMs":5290},{"text":"He actually checked up the dataset's website and found that he beat the state of the art for that.","startMs":4879160,"durationMs":4570},{"text":"Alena Harley did tumor normal sequencing.","startMs":4884990,"durationMs":3010},{"text":"So she was at Human Longevity International.","startMs":4888000,"durationMs":2940},{"text":"So she actually did three different really interesting pieces of cancer work during that first course if I remember correctly.","startMs":4890940,"durationMs":6710},{"text":"And I showed you this picture before.","startMs":4898830,"durationMs":1590},{"text":"What I didn't mention is actually this... this student Gleb was a software developer at Splunk, a big NASDAQ listed company.","startMs":4900420,"durationMs":8680},{"text":"And this student project he did turned into a new patented product at Splunk and a big blog post and the whole thing turned out to be really cool.","startMs":4909100,"durationMs":8920},{"text":"Basically something to identify fraudsters using image recognition with these pictures we discussed.","startMs":4918020,"durationMs":7430},{"text":"One of our students built this startup called Envision.","startMs":4926350,"durationMs":2500},{"text":"Anyway there's been lots and lots of examples.","startMs":4931630,"durationMs":2100},{"text":"So all of this is to say, you know, have... have a go at you know, starting something.","startMs":4934310,"durationMs":7220},{"text":"Create something you think would be fun or or interesting and share it in the forum.","startMs":4941870,"durationMs":3940},{"text":"If you're a total beginner with Python, you know, then start... start with something simple.","startMs":4945990,"durationMs":5110},{"text":"But I think you'll find people very encouraging and if you've done this a few times before then try to push yourself a little bit further.","startMs":4951100,"durationMs":5750},{"text":"And don't forget to look at the quiz questions at the end of the book and see if you can answer them all correctly.","startMs":4957710,"durationMs":5860},{"text":"All right, thanks everybody, so much for coming.","startMs":4967830,"durationMs":2300},{"text":"Okay.","startMs":4970150,"durationMs":530},{"text":"Thanks so much for coming everybody.","startMs":4970680,"durationMs":1380},{"text":"Bye.","startMs":4972060,"durationMs":710}]}